# Задание: Решение линейного уравнения через аргументы командной строки

## Условие задачи

Напишите программу на C, которая принимает с командной строки два числа — коэффициенты `a` и `b` линейного уравнения вида:

```
a * x + b = 0
```

и решает его. В случае корректного ввода программа должна вывести одно из следующих сообщений:

- **Если a = 0 и b = 0** — "Бесконечно много решений (любое x подходит)"
- **Если a = 0 и b ≠ 0** — "Решений нет"
- **Если a ≠ 0** — "Решение: x = …" (с точностью до двух знаков после запятой)

**Пример использования:**

```
./solve_linear 2 -4
Решение: x = 2.00
```

---

## Теоретический разбор (математика)

Рассматривается линейное уравнение вида:

```
a * x + b = 0
```

Три возможных случая:

1. **Если a = 0 и b = 0**:
    - Уравнение принимает вид `0 * x + 0 = 0`, что всегда верно.
    - Любое значение x будет решением.

2. **Если a = 0 и b ≠ 0**:
    - Уравнение становится `0 * x + b = 0`, что невозможно при `b ≠ 0`.
    - Решений нет.

3. **Если a ≠ 0**:
    - Стандартное решение: перенесём `b` и разделим на `a`:
    
    ```
    a * x + b = 0
    a * x = -b
    x = -b / a
    ```

---

## Алгоритм программы

1. Получить аргументы из командной строки: `a` и `b`.
2. Преобразовать строки в числа (используется `atof()`).
3. Провести логическую проверку:
    - Если `a == 0`, далее проверяется `b == 0`, и в зависимости от этого:
        - `b == 0` → любое число подходит.
        - `b ≠ 0` → решений нет.
    - Если `a ≠ 0`, то вычисляется `x = -b / a`.

---

## Код программы

```c
#include <stdio.h>
#include <stdlib.h>

int main(int argc, char *argv[]) {
    // Проверяем, что передано ровно 2 аргумента (a и b)
    if (argc != 3) {
        printf("Usage: %s <a> <b>\n", argv[0]);
        printf("Example: %s 2 4\n", argv[0]);
        return 1;
    }

    // Преобразуем аргументы из строк в числа
    double a = atof(argv[1]);
    double b = atof(argv[2]);

    // Решаем уравнение a*x + b = 0
    if (a == 0) {
        if (b == 0) {
            printf("Infinite number of solutions (any x fits)\n");
        } else {
            printf("No solutions\n");
        }
    } else {
        double x = -b / a;
        printf("Solution: x = %.2f\n", x);
    }

    return 0;
}
```

---

## Примеры запуска

| Ввод командной строки     | Вывод программы                        |
|---------------------------|----------------------------------------|
| `./solve_linear 0 0`      | Бесконечно много решений               |
| `./solve_linear 0 3`      | Решений нет                            |
| `./solve_linear 5 0`      | Решение: x = 0.00                      |
| `./solve_linear 2 -10`    | Решение: x = 5.00                      |
| `./solve_linear -4 -16`   | Решение: x = -4.00                     |